In [1]:
# Exploring data arrays with NumPy
import numpy as np
import pandas as pd
import matplotlib as plt

In [2]:
data = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64]

In [4]:
print(data)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]

In [9]:
#make it a numpy array called grades
grades=np.array(data)

In [10]:
print(grades)

[50 50 47 97 49  3 53 42 26 74 82 62 37 15 70 27 36 35 48 52 63 64]

In [11]:
print(type(data))

<class 'list'>

In [12]:
print(type(grades))

<class 'numpy.ndarray'>

In [13]:
print(type(grades),'x 2',grades*2)

<class 'numpy.ndarray'> x 2 [100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

In [14]:
print(type(data),'x 2',data*2)

<class 'list'> x 2 [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]

In [15]:
# list multiplied by 2 causes it to append
# numpy array multiplied by 2 is executed elementwise

In [16]:
# number of dimensions or shape
grades.shape

(22,)

In [18]:
# indexing - accessing individual positions
grades[2]

47

In [20]:
# some data analysis
grades.mean()

49.18181818181818

In [22]:
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
               13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0]
print(study_hours)

[10.0, 11.5, 9.0, 16.0, 9.25, 1.0, 11.5, 9.0, 8.5, 14.5, 15.5, 13.75, 9.0, 8.0, 15.5, 8.0, 9.0, 6.0, 10.0, 12.0, 12.5, 12.0]

In [23]:
# define an array for the study hours
study=np.array(study_hours)

In [24]:
print(study)

[10.   11.5   9.   16.    9.25  1.   11.5   9.    8.5  14.5  15.5  13.75
  9.    8.   15.5   8.    9.    6.   10.   12.   12.5  12.  ]

In [25]:
print(type(study))

<class 'numpy.ndarray'>

In [28]:
student_data=np.array([grades,study])

In [29]:
print(student_data)

[[50.   50.   47.   97.   49.    3.   53.   42.   26.   74.   82.   62.
  37.   15.   70.   27.   36.   35.   48.   52.   63.   64.  ]
 [10.   11.5   9.   16.    9.25  1.   11.5   9.    8.5  14.5  15.5  13.75
   9.    8.   15.5   8.    9.    6.   10.   12.   12.5  12.  ]]

In [30]:
print(type(student_data))

<class 'numpy.ndarray'>

In [31]:
student_data.shape

(2, 22)

In [32]:
student_data[1][11]

13.75

In [33]:
student_data[0][11
               ]

62.0

In [34]:
# Get the mean value of each sub-array
avg_grade=student_data[0].mean()
avg_study=student_data[1].mean()

In [35]:
print(avg_grade)
print()
print(avg_study)

49.18181818181818

10.522727272727273

In [39]:
print(f'Average grade {avg_grade}')

Average grade 49.18181818181818

In [40]:
print(f'Average study {avg_study}')

Average study 10.522727272727273

In [43]:
print('Average grade: {:.2f}\nAverage study: {:.2f}'.format(avg_study,avg_grade))

Average grade: 10.52
Average study: 49.18

In [46]:
print('Marks for student 2: {:.2f}\nStudy Hours for student 2:{:.2f}'.format(student_data[0][1],student_data[1][1]))

Marks for student 2: 50.00
Study Hours for student 2:11.50

In [48]:
print('Marks for student 10: {:.2f}\nStudy hours for student 10:{:.2f}'.format(student_data[0][9],student_data[1][9]))

Marks for student 10: 74.00
Study hours for student 10:14.50

In [50]:
print("Marks for student 12: {:.2f}\nStudy hours for student 12: {:.2f}".format(student_data[0][11],student_data[1][11]))

Marks for student 12: 62.00
Study hours for student 12: 13.75

In [52]:
names=['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 
                                     'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny',
                                     'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha']

In [53]:
print(names)

['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny', 'Jakeem', 'Helena', 'Ismat', 'Anila', 'Skye', 'Daniel', 'Aisha']

In [54]:
print(type(names))

<class 'list'>

In [59]:
df_students=pd.DataFrame({'Name':names,
                          'Marks':grades,
                          'No. of study hours':study})

In [60]:
df_students

         Name  Marks  No. of study hours
0         Dan     50               10.00
1       Joann     50               11.50
2       Pedro     47                9.00
3       Rosie     97               16.00
4       Ethan     49                9.25
5       Vicky      3                1.00
6    Frederic     53               11.50
7      Jimmie     42                9.00
8      Rhonda     26                8.50
9    Giovanni     74               14.50
10  Francesca     82               15.50
11      Rajab     62               13.75
12    Naiyana     37                9.00
13       Kian     15                8.00
14      Jenny     70               15.50
15     Jakeem     27                8.00
16     Helena     36                9.00
17      Ismat     35                6.00
18      Anila     48               10.00
19       Skye     52               12.00
20     Daniel     63               12.50
21      Aisha     64               12.00

In [62]:
df_students.head()

    Name  Marks  No. of study hours
0    Dan     50               10.00
1  Joann     50               11.50
2  Pedro     47                9.00
3  Rosie     97               16.00
4  Ethan     49                9.25

In [63]:
df_students.tail()

      Name  Marks  No. of study hours
17   Ismat     35                 6.0
18   Anila     48                10.0
19    Skye     52                12.0
20  Daniel     63                12.5
21   Aisha     64                12.0

In [64]:
# Get the data for index value 5
df_students.loc[5]

Name                  Vicky
Marks                     3
No. of study hours      1.0
Name: 5, dtype: object

In [65]:
df_students.loc[2]

Name                  Pedro
Marks                    47
No. of study hours      9.0
Name: 2, dtype: object

In [66]:
df_students.head()

    Name  Marks  No. of study hours
0    Dan     50               10.00
1  Joann     50               11.50
2  Pedro     47                9.00
3  Rosie     97               16.00
4  Ethan     49                9.25

In [67]:
# .loc uses index position

In [68]:
df_students.loc[2:5]

    Name  Marks  No. of study hours
2  Pedro     47                9.00
3  Rosie     97               16.00
4  Ethan     49                9.25
5  Vicky      3                1.00

In [69]:
# it is inclusive of last digit

In [70]:
df_students.head()

    Name  Marks  No. of study hours
0    Dan     50               10.00
1  Joann     50               11.50
2  Pedro     47                9.00
3  Rosie     97               16.00
4  Ethan     49                9.25

In [72]:
#view first 5 rows
df_students.loc[0:4]

    Name  Marks  No. of study hours
0    Dan     50               10.00
1  Joann     50               11.50
2  Pedro     47                9.00
3  Rosie     97               16.00
4  Ethan     49                9.25

In [74]:
# loc uses index position
# iloc goes beyond loc to include columns
df_students.iloc[2,2]

9.0

In [76]:
df_students.iloc[3,[0,1]]

Name     Rosie
Marks       97
Name: 3, dtype: object

In [77]:
df_students.head()

    Name  Marks  No. of study hours
0    Dan     50               10.00
1  Joann     50               11.50
2  Pedro     47                9.00
3  Rosie     97               16.00
4  Ethan     49                9.25

In [78]:
df_students.iloc[3,[1,2]]

Marks                   97
No. of study hours    16.0
Name: 3, dtype: object

In [86]:
df_students.iloc[[1,2],[0,2]]

    Name  No. of study hours
1  Joann                11.5
2  Pedro                 9.0

In [87]:
df_students.loc[1,'Marks']

50

In [90]:
df_students.loc[df_students['Name']=='Aisha']

     Name  Marks  No. of study hours
21  Aisha     64                12.0

In [91]:
df_students.loc[df_students['Name']=='Joann']

    Name  Marks  No. of study hours
1  Joann     50                11.5

In [92]:
df_students.loc[df_students['Name']=='Pedro']

    Name  Marks  No. of study hours
2  Pedro     47                 9.0

In [93]:
df_students[df_students['Name']=='Aisha']

     Name  Marks  No. of study hours
21  Aisha     64                12.0

In [97]:
df_students.query('Name=="Aisha"')

     Name  Marks  No. of study hours
21  Aisha     64                12.0

In [99]:
df_students.query('Name=="Pedro"')

    Name  Marks  No. of study hours
2  Pedro     47                 9.0

In [100]:
df_students.query('Name=="Joann"')

    Name  Marks  No. of study hours
1  Joann     50                11.5

In [101]:
!wget https://raw.githubusercontent.com/MicrosoftDocs/mslearn-introduction-to-machine-learning/main/Data/ml-basics/grades.csv
df_students = pd.read_csv('grades.csv',delimiter=',',header='infer')
df_students.head()

'wget' is not recognized as an internal or external command,
operable program or batch file.

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

In [102]:
# check for missing values
df_students.isnull()

     Name  StudyHours  Grade
0   False       False  False
1   False       False  False
2   False       False  False
3   False       False  False
4   False       False  False
5   False       False  False
6   False       False  False
7   False       False  False
8   False       False  False
9   False       False  False
10  False       False  False
11  False       False  False
12  False       False  False
13  False       False  False
14  False       False  False
15  False       False  False
16  False       False  False
17  False       False  False
18  False       False  False
19  False       False  False
20  False       False  False
21  False       False  False
22  False       False   True
23  False        True   True

In [103]:
# quantify the missing values
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

In [109]:
df_students[df_students.isnull().any(axis=1)]

    Name  StudyHours  Grade
22  Bill         8.0    NaN
23   Ted         NaN    NaN

In [110]:
df_students['StudyHours']=df_students['StudyHours'].fillna(df_students['StudyHours'].mean())

In [111]:
df_students[df_students.isnull().any(axis=1)]

    Name  StudyHours  Grade
22  Bill    8.000000    NaN
23   Ted   10.413043    NaN

In [112]:
df_students=df_students.dropna(axis=0,how='any')

In [113]:
df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [114]:
# Get the mean study hours using to column name as an index
Mean_Study=df_students['StudyHours'].mean()
Mean_Study

10.522727272727273

In [115]:
Mean_Grade=df_students['Grade'].mean()
Mean_Grade

49.18181818181818

In [116]:
print('The average study hours is:{:.2f}\nThe average grade is:{:.2f}'.format(Mean_Study,Mean_Grade))

The average study hours is:10.52
The average grade is:49.18

In [117]:
# students who studied more than the average
df_students[df_students['StudyHours']>Mean_Study]

         Name  StudyHours  Grade
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [118]:
df_students[df_students['Grade']>Mean_Grade]

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [119]:
df_students[df_students['StudyHours']>Mean_Study].mean()

C:\Users\Tinashe.Kaseke\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

StudyHours    13.475
Grade         66.700
dtype: float64

In [121]:
df_students[df_students['StudyHours']>Mean_Study].Grade.mean()

66.7

In [122]:
df_students[df_students['StudyHours']>Mean_Study].StudyHours.mean()

13.475

In [125]:
# observe students who obtained greater than 60%
df_students[df_students['Grade']>=60]

         Name  StudyHours  Grade
3       Rosie       16.00   97.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [126]:
passes=pd.Series(df_students['Grade']>60)

In [128]:
print(passes)

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11     True
12    False
13    False
14     True
15    False
16    False
17    False
18    False
19    False
20     True
21     True
Name: Grade, dtype: bool

In [129]:
df_students=pd.concat([df_students,passes.rename("Pass")],axis=1)

In [130]:
df_students

         Name  StudyHours  Grade   Pass
0         Dan       10.00   50.0  False
1       Joann       11.50   50.0  False
2       Pedro        9.00   47.0  False
3       Rosie       16.00   97.0   True
4       Ethan        9.25   49.0  False
5       Vicky        1.00    3.0  False
6    Frederic       11.50   53.0  False
7      Jimmie        9.00   42.0  False
8      Rhonda        8.50   26.0  False
9    Giovanni       14.50   74.0   True
10  Francesca       15.50   82.0   True
11      Rajab       13.75   62.0   True
12    Naiyana        9.00   37.0  False
13       Kian        8.00   15.0  False
14      Jenny       15.50   70.0   True
15     Jakeem        8.00   27.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
18      Anila       10.00   48.0  False
19       Skye       12.00   52.0  False
20     Daniel       12.50   63.0   True
21      Aisha       12.00   64.0   True

In [137]:
print(df_students.groupby(df_students.Pass).Name.count())

Pass
False    15
True      7
Name: Name, dtype: int64

In [138]:
print(df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean())

       StudyHours      Grade
Pass
False    8.783333  38.000000
True    14.250000  73.142857

C:\Users\Tinashe.Kaseke\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [139]:
df_students = df_students.sort_values('Grade', ascending=False)

In [140]:
df_students

         Name  StudyHours  Grade   Pass
3       Rosie       16.00   97.0   True
10  Francesca       15.50   82.0   True
9    Giovanni       14.50   74.0   True
14      Jenny       15.50   70.0   True
21      Aisha       12.00   64.0   True
20     Daniel       12.50   63.0   True
11      Rajab       13.75   62.0   True
6    Frederic       11.50   53.0  False
19       Skye       12.00   52.0  False
1       Joann       11.50   50.0  False
0         Dan       10.00   50.0  False
4       Ethan        9.25   49.0  False
18      Anila       10.00   48.0  False
2       Pedro        9.00   47.0  False
7      Jimmie        9.00   42.0  False
12    Naiyana        9.00   37.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
15     Jakeem        8.00   27.0  False
8      Rhonda        8.50   26.0  False
13       Kian        8.00   15.0  False
5       Vicky        1.00    3.0  False